# DeleteAllDLComponents

## Description
Deletes all components in the Double Line Preferences.

```pascal
FUNCTION DeleteAllDLComponents : BOOLEAN;
```

```python
def vs.DeleteAllDLComponents():
    return BOOLEAN
```

## Remarks
CJG 6-27-06

## Version
Availability: from VectorWorks12.5

## Category
* Document Settings